app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs" LIMIT $1  [["LIMIT", 1]]

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "blogs"."id" = $4  [["title", "New one update"], ["body", "That´s awesome updated"], ["updated_at", "2022-06-24 11:08:36.649894"], ["id", 4]]